In [1]:
import numpy as np
import pandas as pd

In [1]:
def variance(nums):
    x_bar=sum(nums)/len(nums)
    temp=0
    for i in nums:
        distance=(i-x_bar)**2
        temp+=distance
    return temp/len(nums)

In [3]:
l=[-5,0,5,15,10]
variance(l)

50.0

In [9]:
l=np.array(l)
l.mean()

np.float64(5.0)

In [13]:
df=pd.read_csv('file.csv')

In [17]:
df.tail()

    Length  Width   City    Price
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000

In [18]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [22]:
df['City']

0     Cairo
1      Alex
2     Aswan
3      Alex
4      Giza
5      Alex
6     Luxor
7     Aswan
8      Alex
9     Cairo
10     Giza
Name: City, dtype: object

In [24]:
df['Length'].mean()

np.float64(10.909090909090908)

In [25]:
df['Length'].median()

np.float64(8.0)

In [30]:
df['Length']

0     20
1     15
2     30
3     10
4      5
5     12
6      5
7      7
8      2
9      8
10     6
Name: Length, dtype: int64

In [34]:
print(df.head())
df.tail()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

    Length  Width   City    Price
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000

In [35]:
df['Length'].std()

np.float64(8.141922935701928)

In [36]:
df['Length'].var()

np.float64(66.29090909090908)